{"intents": [

{"tag": "greetings",
"patterns": ["hola", "buenos dias","buenas","Buenas tardes", "hi", "Buenas noches"],
"responses": ["Hola, en que puedo ayudarte hoy?", "¡Bienvenido al servicio de atencion al cliente! En que puedo ayudarte?", "¡Hola! Soy un chatbot de atencion al cliente, como puedo ayudarte hoy?", "¡Hola! Estoy aqui para ayudarte con cualquier pregunta o inquietud que puedas tener, en que puedo ayudarte?", "Hola, como estas? En que puedo ayudarte hoy?"

]},

{"tag":"adios",
"patterns":["adios","bye","hasta luego","ya", "chao"],
"responses":["Ha sido un placer ayudarte hoy, si necesitas algo mas, no dudes en preguntar.", "¡Hasta luego!", "¡Gracias por contactarnos! Si tienes alguna otra pregunta o inquietud, no dudes en volver a hablar con nosotros. ¡Adios!.", "Ha sido un placer ayudarte hoy, si necesitas algo mas, estaremos aqui para ayudarte. ¡Hasta pronto!", "Muchas gracias por utilizar nuestro servicio de atencion al cliente. Si necesitas algo mas, no dudes en contactarnos. ¡Hasta pronto!"

]},

{"tag":"Cuentas",
"patterns":["Como puedo verificar el saldo de mi cuenta?","Como puedo hacer un deposito en mi cuenta?","Como puedo transferir dinero entre mis cuentas o a otras cuentas?",
"Como puedo cambiar mi direccion o informacion de contacto?", "Como puedo obtener un estado de cuenta?",
 "Como puedo obtener ayuda si tengo problemas con mi cuenta o si necesito asistencia tecnica?", "Que tipos de cuentas bancarias ofrece el banco? "],
"responses":["Para verificar el saldo de su cuenta, puede ingresar a su banca en linea o movil, llamar al servicio de atencion al cliente o utilizar un cajero automatico.", "Si, con la tarjeta puedes pagar en cualquier lugar donde acepten tarjetas de credito y disfrutar de todos los beneficios que esta ofrece",
"Para hacer un deposito, puede hacerlo en una sucursal del banco, utilizando un cajero automatico o mediante un deposito directo.", "Para hacer un retiro de efectivo, puede hacerlo en una sucursal del banco, utilizando un cajero automatico o mediante una transferencia electronica.", "Para transferir dinero entre sus cuentas o a otras cuentas, puede hacerlo a traves de su banca en linea o movil, o utilizando un cajero automatico.", "Si, con la tarjeta puedes pagar en cualquier lugar donde acepten tarjetas de credito y disfrutar de todos los beneficios que esta ofrece", "Para obtener un estado de cuenta, puede hacerlo a traves de su banca en linea o movil, o visitando una sucursal del banco.", "El banco ofrece una variedad de cuentas bancarias, como cuentas corrientes, cuentas de ahorro, cuentas conjuntas, cuentas para jubilados, entre otras."
 
 ]},

{"tag":"Beneficios",
 "patterns":["Que tipos de cuentas bancarias ofrece el banco?","Ofrece el banco tarjetas de credito o debito? Cuales son las tasas de interes y las recompensas?","Ofrece el banco servicios de banca en linea o movil?","Ofrece el banco servicios de inversion o asesoramiento financiero?","Ofrece el banco prestamos personales o hipotecarios?","Ofrece el banco seguros de vida o de salud?","Ofrece el banco servicios de cambio de moneda?","Ofrece el banco programas de recompensas o descuentos para sus clientes?","Ofrece el banco servicios de atencion al cliente las 24 horas?","Ofrece el banco servicios de banca internacional?", "Puedo utilizar la tarjeta en el extranjero?"],
"responses":["El banco ofrece una variedad de cuentas bancarias, como cuentas corrientes, cuentas de ahorro, cuentas conjuntas, cuentas para jubilados, entre otras.", "El banco ofrece tarjetas de credito y/o debito con tasas de interes competitivas y programas de recompensas.", "El banco ofrece servicios de banca en linea y/o movil para que los clientes puedan acceder a sus cuentas desde cualquier lugar.", "El banco ofrece servicios de inversion y asesoramiento financiero para ayudar a los clientes a alcanzar sus metas financieras.", "El banco ofrece prestamos personales y/o hipotecarios con tasas de interes competitivas.", "El banco ofrece seguros de vida y/o salud para proteger a los clientes y sus seres queridos.", "El banco ofrece servicios de cambio de moneda para facilitar las transacciones internacionales.", "El banco ofrece programas de recompensas y descuentos para premiar a sus clientes leales.", "El banco ofrece servicios de atencion al cliente las 24 horas para ayudar a los clientes con cualquier problema o pregunta.", "El banco ofrece servicios de banca internacional para ayudar a los clientes a manejar sus transacciones financieras en el extranjero"

]},

{"tag":"Robo",
"patterns":["Que debo hacer si pierdo mi tarjeta de credito o debito?","Como puedo bloquear o cancelar mi tarjeta de credito o debito perdida o robada?","Como puedo solicitar una nueva tarjeta de reemplazo si mi tarjeta de credito o debito se pierde o es robada?","Soy responsable por cualquier cargo fraudulento si mi tarjeta de credito o debito se pierde o es robada?","Como puedo protegerme de las transacciones fraudulentas si mi tarjeta de credito o debito se pierde o es robada?","Que debo hacer si recibo una transaccion no autorizada en mi estado de cuenta de tarjeta de credito o debito despues de haber perdido o reportado mi tarjeta como robada?","Como puedo evitar que mi tarjeta de credito o debito sea utilizada por otra persona despues de haberla perdido o reportado como robada?","Como puedo asegurarme de que mi informacion personal no sea utilizada de manera fraudulenta si mi tarjeta de credito o debito se pierde o es robada?"],
"responses":["Es importante llamar inmediatamente al servicio de atencion al cliente del banco para informar la perdida o robo de la tarjeta y solicitar el bloqueo de la misma.",
"El banco puede bloquear o cancelar su tarjeta de credito o debito perdida o robada y emitir una nueva tarjeta de reemplazo.",
"En general, las leyes y las politicas de los bancos establecen que el cliente no es responsable por cargos fraudulentos si reporta la perdida o robo de la tarjeta de manera oportuna.",
"El banco puede ofrecer servicios de seguridad adicionales como alertas de transacciones por correo electronico o mensaje de texto, ademas de proporcionar asesoramiento sobre como protegerse de las transacciones fraudulentas.",
"El banco puede ayudarlo a reversar cualquier transaccion no autorizada y puede brindar asistencia para reportar cualquier actividad fraudulenta a las autoridades relevantes.",
"El banco puede ofrecer servicios adicionales para evitar que la tarjeta sea utilizada por otra persona, como la emision de una nueva tarjeta con un numero de seguridad diferente.",
"El banco puede brindar asesoramiento sobre como monitorear su informacion personal y como tomar medidas adicionales para proteger su privacidad y seguridad financiera."

]},

{"tag":"prestamos",
"patterns":["Que tipos de prestamos ofrece el banco?", "Cuales son los requisitos para obtener un prestamo?", "Cuales son las tasas de interes y las tarifas asociadas con el prestamo?", "Como puedo aplicar para un prestamo?", "Cual es el proceso de aprobacion de un prestamo?", "Cuanto tiempo toma el proceso de aprobacion de un prestamo?",
"Como puedo pagar mi prestamo?", "Cuales son las opciones de reestructuracion de prestamos si tengo problemas para hacer los pagos?",
"Como puedo verificar el estado de mi prestamo?", "Que hacer si tengo preguntas o problemas con mi prestamo?"],
"responses":["Los bancos pueden ofrecer diferentes tipos de prestamos, como prestamos personales, prestamos hipotecarios, prestamos para automoviles, prestamos para educacion, entre otros.", "Los requisitos para obtener un prestamo pueden variar dependiendo del tipo de prestamo y del banco, pero pueden incluir un buen historial crediticio, ingresos estables y una direccion de residencia verificable.", "Las tasas de interes y las tarifas asociadas con el prestamo pueden variar dependiendo del banco y el tipo de prestamo solicitado.", "Puede aplicar para un prestamo a traves de su banca en linea o visitando una sucursal del banco.", "El proceso de aprobacion de un prestamo puede incluir la verificacion de la informacion proporcionada en la solicitud, un analisis del historial crediticio y la evaluacion de la capacidad del prestatario para hacer los pagos.", "El tiempo de procesamiento de un prestamo puede variar dependiendo del banco y del tipo de prestamo, pero puede tomar desde unos pocos dias hasta varias semanas.", "Los prestamos pueden pagarse mediante pagos mensuales, que incluyen una parte del capital y los intereses adeudados.", "Los bancos pueden ofrecer opciones de reestructuracion de prestamos para ayudar a los prestatarios que tienen problemas para hacer los pagos, como planes de pago aplazado o reduccion de la tasa de interes.", "Puede verificar el estado de su prestamo a traves de su banca en linea o llamando al servicio de atencion al cliente del banco.", "El banco puede brindar asistencia y responder preguntas o problemas relacionados con su prestamo a traves del servicio de atencion al cliente."
             
     ]},

{"tag":"Requisitos para abrir una cuenta",
"patterns":["Que documentos necesito presentar para abrir una cuenta de cheques?", "Necesito tener un historial crediticio para abrir una cuenta bancaria?", "Que tipo de identificacion es necesaria para abrir una cuenta de banco?", "Necesito tener una direccion de residencia verificable para abrir una cuenta de banco?", "Cuales son los requisitos para abrir una cuenta conjunta?", "Que tipo de informacion financiera necesito proporcionar para abrir una cuenta de banco?", "Existen requisitos especiales para abrir una cuenta de banco si soy extranjero?", "Cuales son los requisitos para abrir una cuenta de negocios?", "Necesito tener un cierto saldo para abrir una cuenta de banco?", "Que pasa si no cumplo con los requisitos para abrir una cuenta de banco?"],
"responses":["Los documentos comunes que se necesitan para abrir una cuenta de cheques incluyen una identificacion valida con foto, un comprobante de residencia y un numero de Seguro Social o numero de identificacion fiscal.", "No necesariamente, pero un historial crediticio favorable puede ayudar a obtener mejores tasas de interes y limites de credito mas altos en algunos productos bancarios."," La identificacion valida comunmente aceptada incluye una licencia de conducir, un pasaporte o una tarjeta de identificacion del gobierno.", "Si, es necesario proporcionar una direccion de residencia verificable para abrir una cuenta de banco.", "Los requisitos para abrir una cuenta conjunta pueden variar segun el banco, pero generalmente se necesitan los mismos documentos de identificacion y comprobante de residencia para ambos titulares de la cuenta.", "Los estados financieros, como los ingresos y los activos, pueden ser necesarios para abrir una cuenta de banco."
             
]},

{"tag":"Horario de atencion",
"patterns":["Cuales son los horarios de atencion del chatbot?", "El chatbot esta disponible las 24 horas del dia?", "Como puedo contactar a un agente de atencion al cliente fuera del horario de atencion del chatbot?", "Cuales son los horarios de atencion en las sucursales bancarias?", "Los servicios bancarios en linea estan disponibles las 24 horas del dia?", "Cuales son los horarios de atencion telefonica del banco?", "Que debo hacer si tengo una emergencia bancaria fuera del horario de atencion?", "El chatbot ofrece soporte en dias festivos?", "El horario de atencion del chatbot es el mismo que el horario presencial?", "Hay algun servicio de atencion al cliente disponible en caso de que no pueda acceder al chatbot o a las sucursales bancarias?"],
"responses":["Los horarios de atencion del chatbot pueden variar, pero pueden ser de lunes a viernes de 9:00 am a 5:00 pm, o pueden estar disponibles las 24 horas del dia.", "Puede contactar a un agente de atencion al cliente a traves de un numero de telefono de emergencia o enviando un correo electronico fuera del horario de atencion del chatbot.", "Los horarios de atencion en las sucursales bancarias pueden variar, pero a menudo son de lunes a viernes de 9:00 am a 5:00 pm y los sabados de 9:00 am a 1:00 pm.", "Los servicios bancarios en linea pueden estar disponibles las 24 horas del dia, pero esto puede variar dependiendo del banco.", "Los horarios de atencion telefonica del banco pueden variar, pero a menudo son de lunes a viernes de 9:00 am a 5:00 pm.", "En caso de una emergencia bancaria fuera del horario de atencion, debe contactar al numero de telefono de emergencia proporcionado por su banco.", "El chatbot puede no ofrecer soporte en dias festivos, pero puede"
             
             ]},

{"tag":"Trasferencias",
"patterns":["Como saber si una transferencia se hizo efectiva?", "Como se puede cancelar una transferencia bancaria?", "Cuanto tiempo se demora en llegar una trasferencia de un banco a otro?"],
"responses":["Para saber si una transferencia se hizo efectiva debes consultar el comprobante electronico de pago(CEP), un documento con el que el banco informa que se realizo el pago.", "La cancelacion  de una transferencia bancaria de un banco a otro debe ejecutarse el mismo dia despues de haberse realizado la transaccion y antes de la hora de corte del banco al que lo envio.", "Si la transferencia se hace a una cuenta del mismo banco no se podra cancelar, ya que el envio es casi inmediato.", "La transferencia pueden tomar hasta 3 dias habiles antes de ser recibida por el beneficiario final"

 ]},

{"tag":"Creditos",
"patterns":["Cual es la importancia de credito?", "Cuando es necesario realizar un credito?", "Que pasa si no pago mi credito?"],
"responses":["El credito es importante porque transfiere  poder generalizado de compra que sirve equipo, terreno, materias primas, etc., o para pagar cualquier cuenta o cubrir cualquier gasto.", "Lo mas recomendable es recurrir a un credito solo cuando se esta libre de otras deudas.", "Si despues de un mes no se ha realizado ningun pago, el banco puede empezar a cobrar algunos intereses, la mejor forma de evitar esto es siendo puntual en su cuenta y comunicandose con banco para buscar una mejor solucion."
             
]}

]}


    
