{"intents": [

{"tag": "greetings",
"patterns": ["hola", "buenos dias","buenas","hi"],
"responses": ["Hola!, como te puedo ayudar hoy!", "Buenos dias, en que te puedo ayudar?","Hola, que puedo hacer por ti?", "Hola, en que necesitas ayuda"

]},

{"tag":"adios",
"patterns":["adios","bye","hasta luego","ya", "chao"],
"responses":["Necesita ayuda con algo mas","Adios, gracias por escoger banco fiu fiu","Adios, espero que le ayude", "Espero haber sido de ayuda! Muchas gracias por contactarnos. Saludos!",
"Hasta pronto! espero haberte ayudado","¡Que estés bien! regresa pronto","¡Siempre a la orden! Si requieres algo más, estoy aquí contigo", "¡Gracias por confiar en mí! Si necesitas algo más, estoy Contigo"

]},

{"tag":"Cuentas",
"patterns":["Cómo puedo verificar el saldo de mi cuenta?","¿Cómo puedo hacer un depósito en mi cuenta?","¿Cómo puedo transferir dinero entre mis cuentas o a otras cuentas?",
"¿Cómo puedo cambiar mi dirección o información de contacto?", "¿Cómo puedo obtener un estado de cuenta?",
 "¿Cómo puedo obtener ayuda si tengo problemas con mi cuenta o si necesito asistencia técnica?", "¿Qué tipos de cuentas bancarias ofrece el banco? "],
"responses":["Para verificar el saldo de su cuenta, puede ingresar a su banca en línea o móvil, llamar al servicio de atención al cliente o utilizar un cajero automático.",
"Para hacer un depósito, puede hacerlo en una sucursal del banco, utilizando un cajero automático o mediante un depósito directo.", "Para hacer un retiro de efectivo, puede hacerlo en una sucursal del banco, utilizando un cajero automático o mediante una transferencia electrónica.",
"Para transferir dinero entre sus cuentas o a otras cuentas, puede hacerlo a través de su banca en línea o móvil, o utilizando un cajero automático.",
 "Para obtener un estado de cuenta, puede hacerlo a través de su banca en línea o móvil, o visitando una sucursal del banco.", "El banco ofrece una variedad de cuentas bancarias, como cuentas corrientes, cuentas de ahorro, cuentas conjuntas, cuentas para jubilados, entre otras."
 

]}

]}